{
  "intents": [
    {
      "intent": "Online_supermart",
      "examples": [
        {
          "text": "I want to cancel my order"
        }
      ],
      "description": ""
    },
    {
      "intent": "eCommerce_Defer_Payment",
      "examples": [
        {
          "text": "Payment after due date"
        },
        {
          "text": "Is there any way that I can defer a payment for my phone? I will be on vacation and won't be able to do it from overseas?"
        },
        {
          "text": "I'd like to delay this month's payment by a week please."
        },
        {
          "text": "I would like to extend my payment due date"
        },
        {
          "text": "I need to defer my bill payment by 7 days."
        },
        {
          "text": "I can't pay my bill on time, can I pay it the week after it's due?"
        },
        {
          "text": "I am not able to pay my bill this week. can you please extend the bill due date by 1 week"
        },
        {
          "text": "How can avoid late fees?"
        },
        {
          "text": "How can I postpone making a payment?"
        },
        {
          "text": "Please keep power on I can pay you later"
        },
        {
          "text": "Hi. my payment due date is't convenient for me. could I change it?"
        },
        {
          "text": "Could the due date for my next bill be delayed? I have changed jobs and my old company did not yet pay me?"
        },
        {
          "text": "Can you get payment extension?"
        },
        {
          "text": "Can I pay my bill later than due date?"
        },
        {
          "text": "Can I delay a payment for a couple of days?"
        },
        {
          "text": "Can I defer the balance on my account?"
        },
        {
          "text": "Can I defer a bill please?"
        },
        {
          "text": "Can I ask for a payment deferment?"
        },
        {
          "text": "Bill extension"
        },
        {
          "text": "How can I extent the due date of my payments?"
        }
      ],
      "description": "Delay the payment due date for a current bill."
    },
    {
      "intent": "eCommerce_Recurring_Payment_Autopay",
      "examples": [
        {
          "text": "Manage autopay"
        },
        {
          "text": "I'd like to setup autopay please."
        },
        {
          "text": "I would like to set up monthly payments"
        },
        {
          "text": "I would like to change the account my automatic payment is drawn from please?"
        },
        {
          "text": "I want to know how to set up automatic payments"
        },
        {
          "text": "I want to activate auto payments"
        },
        {
          "text": "I need to make changes to my automatic payments for my account."
        },
        {
          "text": "How to cancel my card automated payments?"
        },
        {
          "text": "How do I turn auto pay on?"
        },
        {
          "text": "How do I sign up for autopay?"
        },
        {
          "text": "How do I sign up for auto on line bill payment?"
        },
        {
          "text": "How do I set up direct debit?"
        },
        {
          "text": "How can I change my recurring payment?"
        },
        {
          "text": "Hi, how can I set up the automated monthly payments?"
        },
        {
          "text": "Automatically pay bills"
        },
        {
          "text": "Do you offer automatic payment set-up?"
        },
        {
          "text": "Can you help me cancel the autopay?"
        },
        {
          "text": "Can I make a payment now and have it be recurring?"
        },
        {
          "text": "Can I change my plan to auto pay?"
        },
        {
          "text": "Auto bill pay"
        }
      ],
      "description": "Start making automatic recurring payments."
    },
    {
      "intent": "eCommerce_Cancel_Product_Order",
      "examples": [
        {
          "text": "I wish to cancel my last order."
        },
        {
          "text": "Can you help me to cancel my last order?"
        },
        {
          "text": "Can you help me to cancel the order which I just placed a few minutes ago?"
        },
        {
          "text": "Cancel existing order"
        },
        {
          "text": "Cancel order placed earlier"
        },
        {
          "text": "Cancel order submitted today"
        },
        {
          "text": "How can I cancel my order of your extended data service?"
        },
        {
          "text": "How can I cancel my previous order?"
        },
        {
          "text": "I just placed and order, but I need to cancel it."
        },
        {
          "text": "I made an order yesterday, can I cancel it?"
        },
        {
          "text": "I need to cancel an order that I placed."
        },
        {
          "text": "I need to cancel the most recent order. how do I do this?"
        },
        {
          "text": "I need to speak to someone about an order I made not long ago, I need to cancel it please"
        },
        {
          "text": "I recently placed an order for a new phone online. I've changed my mind. can you please cancel my order?"
        },
        {
          "text": "I want to cancel the new device switch order I placed"
        },
        {
          "text": "I want to cancel the order"
        },
        {
          "text": "I wish to cancel my recent order"
        },
        {
          "text": "I've bought an keyboard and id like to cancel it"
        },
        {
          "text": "Please cancel the order I've made this morning"
        },
        {
          "text": "Please cancel the order that was recently placed."
        }
      ],
      "description": "Cancel an order."
    },
    {
      "intent": "eCommerce_Statements",
      "examples": [
        {
          "text": "Can I check my bill?"
        },
        {
          "text": "What was my last bill?"
        },
        {
          "text": "What are the steps for checking credit card statement for particular duration?"
        },
        {
          "text": "What are my bills details?"
        },
        {
          "text": "Show my bill"
        },
        {
          "text": "My bank statement shows an unexpected payment to you so I would like a copy of my latest billing statement."
        },
        {
          "text": "Is there any sort of extra fee for paper invoices?"
        },
        {
          "text": "I want to request a credit card statement"
        },
        {
          "text": "I want a physical copy of credit card history"
        },
        {
          "text": "I want a copy of the bill from last month"
        },
        {
          "text": "I wanna see my bill"
        },
        {
          "text": "I seem to have misplaced my most recent billing statement and would appreciate if you sent me a replacement one."
        },
        {
          "text": "I need to know more about my paper statements that I receive at home"
        },
        {
          "text": "How do I view my e-bill?"
        },
        {
          "text": "How do I get a previous month's bill?"
        },
        {
          "text": "How can I save statements of credit card?"
        },
        {
          "text": "Help me find my bill"
        },
        {
          "text": "Could you please send a print out of my late statement?"
        },
        {
          "text": "Can I request credit card statement right from this chat window?"
        },
        {
          "text": "Can I get another copy of my bill?"
        }
      ],
      "description": "Request a billing statement."
    },
    {
      "intent": "eCommerce_Modify_Product_Order",
      "examples": [
        {
          "text": "Can I change my order for a new device?"
        },
        {
          "text": "Can I change the number on the order from three to four?"
        },
        {
          "text": "I want to cancel order"
        },
        {
          "text": "Is there a way to modify a previous order?"
        },
        {
          "text": "I'd like to change some things with my most recent order"
        },
        {
          "text": "I would like to modify an order I made."
        },
        {
          "text": "I would like to add additional items to an order."
        },
        {
          "text": "I want to update my order."
        },
        {
          "text": "I want to modify an order made"
        },
        {
          "text": "I want to edit an order"
        },
        {
          "text": "I want to change my last order but I don't want to cancel it. can I do that?"
        },
        {
          "text": "I ordered a new phone today but forgot to add an extra charger. can you please add it to my original order."
        },
        {
          "text": "I need to make a change to my current order"
        },
        {
          "text": "I need to change my order help please"
        },
        {
          "text": "I need to amend the order I placed yesterday please"
        },
        {
          "text": "How do I change the phone that I ordered?"
        },
        {
          "text": "How can I chance my order?"
        },
        {
          "text": "Hey I would like to change the delivery date on my order please"
        },
        {
          "text": "Changed mind on last order"
        },
        {
          "text": "Can you help me modify the order that I just placed?"
        },
        {
          "text": "Can you change the order I just placed?"
        }
      ],
      "description": "Change or modify a placed order."
    },
    {
      "intent": "eCommerce_Product_Order_Status",
      "examples": [
        {
          "text": "Order progress"
        },
        {
          "text": "Yes it was attempted for delivery but it says the parcel was refused though we were in the flat"
        },
        {
          "text": "Yes I want to track my order"
        },
        {
          "text": "Where is my order?"
        },
        {
          "text": "When is my new phone supposed to arrive?"
        },
        {
          "text": "What state you are in with my current order?"
        },
        {
          "text": "Tracking number"
        },
        {
          "text": "Shipping status"
        },
        {
          "text": "Please, can you tell me about the status of an orden I made?"
        },
        {
          "text": "Can I check on my order?"
        },
        {
          "text": "I would like to check the status of an order I placed recently."
        },
        {
          "text": "I was just wondering if I could check the status of an order I made."
        },
        {
          "text": "I want a status report on an order I made last week."
        },
        {
          "text": "I purchased an item the other day and still haven't received an update about it, have you shipped it yet?"
        },
        {
          "text": "How soon can we expect the new shipment of iphone 7 that was pre ordered last week?"
        },
        {
          "text": "How do I track my shipment?"
        },
        {
          "text": "Has the order been dispatched yet?"
        },
        {
          "text": "Has my new phone shipped yet?"
        },
        {
          "text": "Expected to ship"
        },
        {
          "text": "Can you track the whereabouts of this sim I ordered?"
        }
      ],
      "description": "Request status of an order that has been placed."
    },
    {
      "intent": "eCommerce_Past_Payment_Inquiry",
      "examples": [
        {
          "text": "Does the payment for july is already done?"
        },
        {
          "text": "Have I paid my bill?"
        },
        {
          "text": "How can I know my payment went through?"
        },
        {
          "text": "How do I review my payments?"
        },
        {
          "text": "I already pay that in this month"
        },
        {
          "text": "I can't find my payment"
        },
        {
          "text": "I need some details about my last month payment."
        },
        {
          "text": "I paid my bill but got sent an overdue notice, my bank statement shows it went through so why does it say its overdue?"
        },
        {
          "text": "I want payment information by a device two months ago"
        },
        {
          "text": "I want to make sure that a payment was credited to my account. can you verify that?"
        },
        {
          "text": "I'd like to check the status of a bill I paid as it has not been credited to my account."
        },
        {
          "text": "Indicate payment for the purchase of my device six months ago"
        },
        {
          "text": "My bill says I didn't make a payment last month, but I did, can you look into this please?"
        },
        {
          "text": "Past payment"
        },
        {
          "text": "Verify payment"
        },
        {
          "text": "Wanted to make sure my payment was received."
        },
        {
          "text": "What is the confirmation number for the payment I made on july 4, 2016?"
        },
        {
          "text": "When was this specific payment made?"
        },
        {
          "text": "Can I get a payment record for these whole year?"
        },
        {
          "text": "Can you tell me if I paid my bill with my credit card?"
        }
      ],
      "description": "Inquire about payments made in the past."
    },
    {
      "intent": "eCommerce_Method_Of_Payment",
      "examples": [
        {
          "text": "Direct transfer"
        },
        {
          "text": "Do you accept visa?"
        },
        {
          "text": "Do you take discover?"
        },
        {
          "text": "Hi, can I pay for the service by paypal?"
        },
        {
          "text": "How can I pay you?"
        },
        {
          "text": "I need to add a new payment card"
        },
        {
          "text": "I need to change my credit card"
        },
        {
          "text": "I want to change my payment preferences."
        },
        {
          "text": "I want to switch what card my payment is taken from"
        },
        {
          "text": "Is there a chance I can pay with cash upon delivery?"
        },
        {
          "text": "Morning, can you tell me by what methods I can settle my monthly bill?"
        },
        {
          "text": "Pay by email"
        },
        {
          "text": "Till now, I was paying in cash. may I pay the future payments through credit card?"
        },
        {
          "text": "Update card"
        },
        {
          "text": "What are the payment methods?"
        },
        {
          "text": "What are your payment options?"
        },
        {
          "text": "What did I pay for credit card?"
        },
        {
          "text": "What kind of payments are accepted?"
        },
        {
          "text": "Change payment setup"
        },
        {
          "text": "Do you accept bank wires?"
        }
      ],
      "description": "Manage the method of payment for a bill."
    },
    {
      "intent": "eCommerce_Balance_Inquiry",
      "examples": [
        {
          "text": "Can I see my account balance?"
        },
        {
          "text": "Can I check my data balance?"
        },
        {
          "text": "Yes, I want to check my balance"
        },
        {
          "text": "What's my balance?"
        },
        {
          "text": "What was my account balance as of june 1st, 2016?"
        },
        {
          "text": "What is the remaining balance?"
        },
        {
          "text": "What is my full balance?"
        },
        {
          "text": "What is my current outstanding?"
        },
        {
          "text": "Show balance"
        },
        {
          "text": "I'd like to find out how much I owe"
        },
        {
          "text": "I would like to check how much my bill is please thank you"
        },
        {
          "text": "I want to ask about my account balance"
        },
        {
          "text": "How much is my next payment?"
        },
        {
          "text": "Hello. I want to know how much I have to pay this month"
        },
        {
          "text": "Give me the amount due"
        },
        {
          "text": "Current bill amount"
        },
        {
          "text": "Can you tell me my current balance please?"
        },
        {
          "text": "Can you tell me how much my bill is for this month, I think it is going to be expensive?"
        },
        {
          "text": "Can you help me check my balance?"
        },
        {
          "text": "Can you assist me to check my balance?"
        }
      ],
      "description": "Inquire about an account balance."
    },
    {
      "intent": "eCommerce_Refund_Payment",
      "examples": [
        {
          "text": "Can I get a refund when my internet was out for 6 hours?"
        },
        {
          "text": "Can I get my last month refunded due to the contract cancelation?"
        },
        {
          "text": "Can I just have a full refund?"
        },
        {
          "text": "Can you refund all payments?"
        },
        {
          "text": "Do I get a refund if I paid too much?"
        },
        {
          "text": "I am unfairly charged. am I going to be refunded?"
        },
        {
          "text": "I paid my bill twice last month. can you refund my last payment?"
        },
        {
          "text": "I want a refund on the previous purchase I made."
        },
        {
          "text": "I was charged for services that I don't subscribe to. how can I go about getting a refund"
        },
        {
          "text": "I was overcharged on my last bill, I need that refunded."
        },
        {
          "text": "I would like a refund for the service outage last month please."
        },
        {
          "text": "If I cancel some services which have been prepaid, can I receive a refund for part of what has already been paid? what is your refund policy?"
        },
        {
          "text": "Is it possible to refund the latest payment that I made?"
        },
        {
          "text": "My credit card was double charged for my last bill. how do I get the extra charge refunded to it?"
        },
        {
          "text": "My service was interrupted for 5 days. I would like a refund based on the time that the service was unavailable."
        },
        {
          "text": "Refund my payment"
        },
        {
          "text": "Where can I get refunds?"
        },
        {
          "text": "Who do I have to speak to get a refund on one of my payments?"
        },
        {
          "text": "Arrange refund"
        },
        {
          "text": "Can I get a refund on the activation fee?"
        }
      ],
      "description": "Request a refund for a payment."
    },
    {
      "intent": "eCommerce_Create_Product_Order",
      "examples": [
        {
          "text": "Can you tell me which phones are on sale this week? I want to buy a new phone?"
        },
        {
          "text": "Help me to create a new order"
        },
        {
          "text": "How do I go about placing an order with you?"
        },
        {
          "text": "I am ready to order now."
        },
        {
          "text": "I need a new cell phone"
        },
        {
          "text": "I need jeans"
        },
        {
          "text": "I need some assistance in purchasing a pre paid mobile phone as well as a sim"
        },
        {
          "text": "I want to reorder"
        },
        {
          "text": "I would like a sim"
        },
        {
          "text": "I would like to purchase a new device for cash"
        },
        {
          "text": "Make the order again"
        },
        {
          "text": "Ok order this for me"
        },
        {
          "text": "Order and payment for device"
        },
        {
          "text": "Place order for device"
        },
        {
          "text": "Purchase something new"
        },
        {
          "text": "What are the methods to place an order?"
        },
        {
          "text": "Where I can order?"
        },
        {
          "text": "Where to buy a camera?"
        },
        {
          "text": "Buy accessories"
        },
        {
          "text": "Can I order some products?"
        }
      ],
      "description": "Place an order."
    },
    {
      "intent": "eCommerce_Make_A_Payment",
      "examples": [
        {
          "text": "I need to schedule a payment"
        },
        {
          "text": "Want to pay"
        },
        {
          "text": "Schedule payment"
        },
        {
          "text": "Right now, I am in a different city and how to make cash payment as today is the due date"
        },
        {
          "text": "Request bill pay"
        },
        {
          "text": "Pay my account"
        },
        {
          "text": "I'd like to pay"
        },
        {
          "text": "I would like to ask a question about making a payment."
        },
        {
          "text": "I want to pay my bill with a credit card"
        },
        {
          "text": "I want to make payment"
        },
        {
          "text": "I want to make a one time payment and enter my debit card payment information"
        },
        {
          "text": "I think I'm gonna pay the bill"
        },
        {
          "text": "I need to pay the cost of my service plan"
        },
        {
          "text": "I also want to make a payment when I have you here on chat"
        },
        {
          "text": "How can I pay off my balance?"
        },
        {
          "text": "Handle payment?"
        },
        {
          "text": "Can you assist me with paying my bill?"
        },
        {
          "text": "Can I pay my bill?"
        },
        {
          "text": "Can I do a bill payment?"
        },
        {
          "text": "Bugger me I wanna pay me bill"
        }
      ],
      "description": "Make a payment."
    },
    {
      "intent": "eCommerce_Dispute",
      "examples": [
        {
          "text": "Can you change my bill?"
        },
        {
          "text": "Why was I charged multiple times for the same purchase?"
        },
        {
          "text": "Why was I charged an administration fee?"
        },
        {
          "text": "Why late fee?"
        },
        {
          "text": "Why is there an increase in this months bill from last month?"
        },
        {
          "text": "What's a 'restoral fee' and why did you charge me $50.00 for it?"
        },
        {
          "text": "What is the $5.00 charge related to?"
        },
        {
          "text": "What do I do if my bill is wrong?"
        },
        {
          "text": "What are the items on my bill?"
        },
        {
          "text": "Please check the output for my last credit card transaction"
        },
        {
          "text": "Need explanation for the settlement of loan against credit card"
        },
        {
          "text": "I'm not at all pleased with your data speed and I don't feel like I'm getting my money's worth. so I'd like an adjustment"
        },
        {
          "text": "I'd like credit for interrupted service."
        },
        {
          "text": "I noticed on my bill that I get charged every month for an extra line. I do not have an extra line. can you please check?"
        },
        {
          "text": "I need to request an adjustment on my billing statement."
        },
        {
          "text": "I need to readjust my credit card, I am getting endless late fee's despite paying on the due date, I want answers."
        },
        {
          "text": "I don't agree with the charge"
        },
        {
          "text": "How to get a bill corrected?"
        },
        {
          "text": "Explain phone bill"
        },
        {
          "text": "Can you help me understand my bill?"
        }
      ],
      "description": "Dispute an issue about a bill."
    },
    {
      "intent": "eCommerce_Payment_Due_Date",
      "examples": [
        {
          "text": "Date of payment"
        },
        {
          "text": "How can I check when my monthly payment is due?"
        },
        {
          "text": "I need to know the due date for my phone bill"
        },
        {
          "text": "I wonder what is my payment date?"
        },
        {
          "text": "I would like to know the due date of my bill"
        },
        {
          "text": "Is there any grace period with due dates?"
        },
        {
          "text": "Next billing due"
        },
        {
          "text": "On what day is my cellphone payment due?"
        },
        {
          "text": "Statement due"
        },
        {
          "text": "What day do I have to make my payment by?"
        },
        {
          "text": "When due?"
        },
        {
          "text": "When is my current amount due?"
        },
        {
          "text": "When is my current bill pay date?"
        },
        {
          "text": "When is my payment due by?"
        },
        {
          "text": "When is the day for paying the bils?"
        },
        {
          "text": "When is the next payment date?"
        },
        {
          "text": "When will be my next day of payment?"
        },
        {
          "text": "Can you remind me when is my payment due day?"
        },
        {
          "text": "Which is the deadline for the settlement of my bills?"
        },
        {
          "text": "Could you pls advise on due date of my bill?"
        }
      ],
      "description": "Inquire about when the next payment is due."
    }
  ],
  "entities": [],
  "metadata": {
    "api_version": {
      "major_version": "v2",
      "minor_version": "2018-11-08"
    },
    "from-sample": true
  },
  "dialog_nodes": [
    {
      "type": "standard",
      "title": "Select item",
      "output": {
        "generic": [
          {
            "values": [
              {
                "text": "Select the particular items"
              }
            ],
            "response_type": "text",
            "selection_policy": "sequential"
          },
          {
            "values": [
              {
                "text": "Pulses"
              },
              {
                "text": "Rice"
              }
            ],
            "response_type": "text",
            "selection_policy": "sequential"
          }
        ]
      },
      "dialog_node": "node_1_1590487703396",
      "previous_sibling": "Welcome"
    },
    {
      "type": "standard",
      "title": "Placeorder",
      "dialog_node": "node_5_1590487639658",
      "previous_sibling": "node_1_1590487703396"
    },
    {
      "type": "standard",
      "title": "Anything else",
      "output": {
        "generic": [
          {
            "values": [
              {
                "text": "I didn't understand. You can try rephrasing."
              },
              {
                "text": "Can you reword your statement? I'm not understanding."
              },
              {
                "text": "I didn't get your meaning."
              }
            ],
            "response_type": "text",
            "selection_policy": "sequential"
          }
        ]
      },
      "conditions": "anything_else",
      "dialog_node": "Anything else",
      "previous_sibling": "node_5_1590487639658",
      "disambiguation_opt_out": true
    },
    {
      "type": "standard",
      "title": "Welcome to hypermart",
      "output": {
        "generic": [
          {
            "values": [
              {
                "text": "Hello. How can I help you?"
              }
            ],
            "response_type": "text",
            "selection_policy": "sequential"
          }
        ]
      },
      "conditions": "welcome",
      "dialog_node": "Welcome"
    }
  ],
  "counterexamples": [],
  "system_settings": {
    "off_topic": {
      "enabled": true
    },
    "disambiguation": {
      "prompt": "Did you mean:",
      "enabled": true,
      "randomize": true,
      "max_suggestions": 5,
      "suggestion_text_policy": "title",
      "none_of_the_above_prompt": "None of the above"
    },
    "system_entities": {
      "enabled": true
    },
    "human_agent_assist": {
      "prompt": "Did you mean:"
    },
    "spelling_auto_correct": true
  },
  "learning_opt_out": false,
  "name": "Search_items",
  "language": "en",
  "description": "To search for a particular item"
}